In [3]:
import numpy as np
import pandas as pd
s1 = pd.Series([1,2,3,4,5,6,7,8,9,10])
s2 = pd.Series([12.23,23.34,15.3,55.3,65.3,64.6,96.7,48.2,61.2,88.2])
s3 = pd.Series(['a','b','c','d','e','f','g','h','i','j'])
data1 = {"column1":s1,"column2":s2,"column3":s3}
df3 = pd.DataFrame(data1)
df3

   column1  column2 column3
0        1    12.23       a
1        2    23.34       b
2        3    15.30       c
3        4    55.30       d
4        5    65.30       e
5        6    64.60       f
6        7    96.70       g
7        8    48.20       h
8        9    61.20       i
9       10    88.20       j

In [9]:
df3 = df3.set_index("column3")
df3

         column1  column2
column3
a              1    12.23
b              2    23.34
c              3    15.30
d              4    55.30
e              5    65.30
f              6    64.60
g              7    96.70
h              8    48.20
i              9    61.20
j             10    88.20

In [10]:
df3 = df3.reset_index()
df3

  column3  column1  column2
0       a        1    12.23
1       b        2    23.34
2       c        3    15.30
3       d        4    55.30
4       e        5    65.30
5       f        6    64.60
6       g        7    96.70
7       h        8    48.20
8       i        9    61.20
9       j       10    88.20

In [14]:
label = list('abcdefghij')
label

['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

In [16]:
df3 = df3.set_index([pd.Index(label)])
df3

  column3  column1  column2
a       a        1    12.23
b       b        2    23.34
c       c        3    15.30
d       d        4    55.30
e       e        5    65.30
f       f        6    64.60
g       g        7    96.70
h       h        8    48.20
i       i        9    61.20
j       j       10    88.20

In [20]:
df3 = df3.drop(['column3'],axis=1)
df3

   column1  column2
a        1    12.23
b        2    23.34
c        3    15.30
d        4    55.30
e        5    65.30
f        6    64.60
g        7    96.70
h        8    48.20
i        9    61.20
j       10    88.20

In [28]:
df3.drop(['a','c'],axis=0)

   column1  column2
b        2    23.34
d        4    55.30
e        5    65.30
f        6    64.60
g        7    96.70
h        8    48.20
i        9    61.20
j       10    88.20

## Working with csv file

In [61]:
df = pd.read_csv("diamonds.csv",index_col=0,nrows=10,na_values=" ")
df

    carat        cut color clarity  depth  table  price     x     y     z
1    0.23      Ideal     E     SI2   61.5     55    326   NaN  3.98  2.43
2    0.21    Premium     E     SI1   59.8     61    326  3.89   NaN  2.31
3    0.23       Good     E     VS1    NaN     65    327  4.05  4.07  2.31
4    0.29    Premium     I     VS2   62.4     58    334  4.20  4.23  2.63
5    0.31       Good     J     SI2   63.3     58    335  4.34  4.35  2.75
6    0.24  Very Good     J    VVS2   62.8     57    336  3.94  3.96  2.48
7    0.24  Very Good     I    VVS1   62.3     57    336  3.95  3.98  2.47
8    0.26  Very Good     H     SI1   61.9     55    337  4.07  4.11  2.53
9    0.22       Fair     E     VS2   65.1     61    337  3.87  3.78  2.49
10   0.23  Very Good     H     VS1   59.4     61    338  4.00  4.05  2.39

In [51]:
df.shape

(10, 10)

In [62]:
pd.isnull(df)

    carat    cut  color  clarity  depth  table  price      x      y      z
1   False  False  False    False  False  False  False   True  False  False
2   False  False  False    False  False  False  False  False   True  False
3   False  False  False    False   True  False  False  False  False  False
4   False  False  False    False  False  False  False  False  False  False
5   False  False  False    False  False  False  False  False  False  False
6   False  False  False    False  False  False  False  False  False  False
7   False  False  False    False  False  False  False  False  False  False
8   False  False  False    False  False  False  False  False  False  False
9   False  False  False    False  False  False  False  False  False  False
10  False  False  False    False  False  False  False  False  False  False

In [65]:
df.dropna()

    carat        cut color clarity  depth  table  price     x     y     z
4    0.29    Premium     I     VS2   62.4     58    334  4.20  4.23  2.63
5    0.31       Good     J     SI2   63.3     58    335  4.34  4.35  2.75
6    0.24  Very Good     J    VVS2   62.8     57    336  3.94  3.96  2.48
7    0.24  Very Good     I    VVS1   62.3     57    336  3.95  3.98  2.47
8    0.26  Very Good     H     SI1   61.9     55    337  4.07  4.11  2.53
9    0.22       Fair     E     VS2   65.1     61    337  3.87  3.78  2.49
10   0.23  Very Good     H     VS1   59.4     61    338  4.00  4.05  2.39

In [66]:
df.dropna(axis=1)

    carat        cut color clarity  table  price     z
1    0.23      Ideal     E     SI2     55    326  2.43
2    0.21    Premium     E     SI1     61    326  2.31
3    0.23       Good     E     VS1     65    327  2.31
4    0.29    Premium     I     VS2     58    334  2.63
5    0.31       Good     J     SI2     58    335  2.75
6    0.24  Very Good     J    VVS2     57    336  2.48
7    0.24  Very Good     I    VVS1     57    336  2.47
8    0.26  Very Good     H     SI1     55    337  2.53
9    0.22       Fair     E     VS2     61    337  2.49
10   0.23  Very Good     H     VS1     61    338  2.39